InformationRegisters/ПриглашенияКОбменуЭлектроннымиДокументами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ПриглашенияКОбменуЭлектроннымиДокументами</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИдентификаторКонтрагента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторОператора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИНН</Name>
					<Comment>Данные организации, владеющей идентификатором контрагента, указанном в приглашении. Являются достоверными только при статусах приглашения "Принято", "ТребуетсяСогласие". Используется для: 1) заполнения в служебных квитанциях (извещении о получении, уведомлении об уточнении, предложении об аннулировании), так как в них указываются данные транспортных участников обмена, а не логических (т.е. в документе может быть один контрагент, а получен он может быть от другого).</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КПП</Name>
					<Comment>Данные организации, владеющей идентификатором контрагента, указанном в приглашении. Являются достоверными только при статусах приглашения "Принято", "ТребуетсяСогласие". Используется для: 1) заполнения в служебных квитанциях (извещении о получении, уведомлении об уточнении, предложении об аннулировании), так как в них указываются данные транспортных участников обмена, а не логических (т.е. в документе может быть один контрагент, а получен он может быть от другого).</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПриглашений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПриглашений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзмененияСтатуса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Ссылка на контрагента информационной базы, соответствующего владельцу идентификатора контрагента, указанного в приглашении. Используется для: 1) заполнения его во входящем произвольном документе в случае, если данные контрагента не указаны в транспортной информации; 2) вывода и фильтрации в списке приглашений; 3) стартового создания настроек отправки/получения при переходе связи в состояние "Принято".</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УчастникЭДО</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Comment>Данные организации, владеющей идентификатором контрагента, указанном в приглашении. Являются достоверными только при статусах приглашения "Принято", "ТребуетсяСогласие". Используется для: 1) заполнения в служебных квитанциях (извещении о получении, уведомлении об уточнении, предложении об аннулировании), так как в них указываются данные транспортных участников обмена, а не логических (т.е. в документе может быть один контрагент, а получен он может быть от другого).</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EmailКонтрагента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EmailОрганизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстПриглашения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ознакомиться</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Ключ</Name>
					<Comment>Для внутренних операций - "КлючПриглашения", для взаимодействия с сервисом - "ВнешнийКод", "ExternalContactId". При отправке широковещательного приглашения не заполняется.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторОрганизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/ПриглашенияЭДОСобытия/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Вызывается после записи приглашения.
// 
// Параметры:
//  СведенияОПриглашении - см. ПриглашенияЭДОСлужебный.СведенияОЗаписанномПриглашении
//
Процедура ПослеИзмененияПриглашения(СведенияОПриглашении) Экспорт
	
	НастройкиЭДО.ПослеИзмененияПриглашения(СведенияОПриглашении);

	СинхронизацияЭДОСобытия.ПослеИзмененияСтатусаПриглашения(
		СведенияОПриглашении.ИдентификаторОрганизации, СведенияОПриглашении.ИдентификаторКонтрагента,
		СведенияОПриглашении.Статус, СведенияОПриглашении.КонтекстДиагностики);
	
КонецПроцедуры

// См. ОбменСКонтрагентамиИнтеграцияСобытия.ПриЗаполненииСписковСОграничениемДоступа
Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт
	
	Списки.Вставить(Метаданные.РегистрыСведений.ПриглашенияКОбменуЭлектроннымиДокументами, Истина);
	
КонецПроцедуры

// См. ОбменСКонтрагентамиИнтеграцияСобытия.ПриЗаполненииВидовОграниченийПравОбъектовМетаданных
Процедура ПриЗаполненииВидовОграниченийПравОбъектовМетаданных(Описание) Экспорт
	
	Описание = Описание + "
	|РегистрСведений.ПриглашенияКОбменуЭлектроннымиДокументами.Чтение.Организации
	|РегистрСведений.ПриглашенияКОбменуЭлектроннымиДокументами.Изменение.Организации
	|";
	
КонецПроцедуры

#КонецОбласти
